print=('Шляпкат гриба, покрытая ... кожиц..й, держится на ... ножк.. . Снизу шляпка затянута ... пленкой. Когда ее уберешь, откроется нижняя ... сторона шляпк.. .')

a=input('введите первое слово: ')
b=input('введите первую букву: ')
c=input('введите второе слово: ')
d=input('введите вторую букву: ')
e=input('введите третье слово: ')
f=input('введите четвертое слово: ')
g=input('введите четвертую  букву: ')

print(f'Шляпкат гриба, покрытая {a} кожиц{b}й, держится на {c} ножк{d} . Снизу шляпка затянута {e} пленкой. Когда ее уберешь, откроется нижняя {f} сторона шляпк{g} .')

